testing/jmeter/reports/report-legal-10vu/statistics.json
{
  "Setup 2 - POST Login Klien-2" : {
    "transaction" : "Setup 2 - POST Login Klien-2",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3462.4999999999995,
    "medianResTime" : 3549.5,
    "minResTime" : 2697.0,
    "maxResTime" : 4462.0,
    "pct1ResTime" : 4424.2,
    "pct2ResTime" : 4462.0,
    "pct3ResTime" : 4462.0,
    "throughput" : 0.6671559143371806,
    "receivedKBytesPerSec" : 34.45417264327173,
    "sentKBytesPerSec" : 0.5961402945493361
  },
  "Setup 2 - POST Login Klien-1" : {
    "transaction" : "Setup 2 - POST Login Klien-1",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1541.0,
    "medianResTime" : 1207.5,
    "minResTime" : 800.0,
    "maxResTime" : 3071.0,
    "pct1ResTime" : 3038.0,
    "pct2ResTime" : 3071.0,
    "pct3ResTime" : 3071.0,
    "throughput" : 0.8281573498964804,
    "receivedKBytesPerSec" : 1.527723861283644,
    "sentKBytesPerSec" : 0.735151397515528
  },
  "Setup 2 - POST Login Klien-0" : {
    "transaction" : "Setup 2 - POST Login Klien-0",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1658.7999999999997,
    "medianResTime" : 1661.0,
    "minResTime" : 1040.0,
    "maxResTime" : 2520.0,
    "pct1ResTime" : 2472.5,
    "pct2ResTime" : 2520.0,
    "pct3ResTime" : 2520.0,
    "throughput" : 0.929195316855603,
    "receivedKBytesPerSec" : 1.686888763705631,
    "sentKBytesPerSec" : 0.9872700241590782
  },
  "Setup 3 - GET Form Pra-Pendaftaran" : {
    "transaction" : "Setup 3 - GET Form Pra-Pendaftaran",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1774.1000000000001,
    "medianResTime" : 1632.0,
    "minResTime" : 1008.0,
    "maxResTime" : 3016.0,
    "pct1ResTime" : 2969.7000000000003,
    "pct2ResTime" : 3016.0,
    "pct3ResTime" : 3016.0,
    "throughput" : 0.7037297677691766,
    "receivedKBytesPerSec" : 22.361288265306122,
    "sentKBytesPerSec" : 0.6377551020408163
  },
  "Step 1 - GET Login Page (Legal)" : {
    "transaction" : "Step 1 - GET Login Page (Legal)",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1441.0,
    "medianResTime" : 1403.0,
    "minResTime" : 925.0,
    "maxResTime" : 1978.0,
    "pct1ResTime" : 1977.8,
    "pct2ResTime" : 1978.0,
    "pct3ResTime" : 1978.0,
    "throughput" : 0.6645401382243488,
    "receivedKBytesPerSec" : 5.860802722953216,
    "sentKBytesPerSec" : 0.5873133057549176
  },
  "Setup 5 - POST Logout Klien-0" : {
    "transaction" : "Setup 5 - POST Logout Klien-0",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1968.1,
    "medianResTime" : 1903.5,
    "minResTime" : 1135.0,
    "maxResTime" : 3010.0,
    "pct1ResTime" : 3009.3,
    "pct2ResTime" : 3010.0,
    "pct3ResTime" : 3010.0,
    "throughput" : 0.5774338838203026,
    "receivedKBytesPerSec" : 1.0200956013973899,
    "sentKBytesPerSec" : 0.5853284877006583
  },
  "PF-07 - POST Submit Verifikasi Berkas-1" : {
    "transaction" : "PF-07 - POST Submit Verifikasi Berkas-1",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2731.4,
    "medianResTime" : 2881.5,
    "minResTime" : 1667.0,
    "maxResTime" : 3966.0,
    "pct1ResTime" : 3929.7000000000003,
    "pct2ResTime" : 3966.0,
    "pct3ResTime" : 3966.0,
    "throughput" : 0.5697681043815167,
    "receivedKBytesPerSec" : 26.84353366617287,
    "sentKBytesPerSec" : 0.5169087587601846
  },
  "Setup 5 - POST Logout Klien-1" : {
    "transaction" : "Setup 5 - POST Logout Klien-1",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1278.0,
    "medianResTime" : 1099.5,
    "minResTime" : 684.0,
    "maxResTime" : 2093.0,
    "pct1ResTime" : 2089.5,
    "pct2ResTime" : 2093.0,
    "pct3ResTime" : 2093.0,
    "throughput" : 0.647920176234288,
    "receivedKBytesPerSec" : 16.903503425877933,
    "sentKBytesPerSec" : 0.5694610923934171
  },
  "Setup 4 - POST Submit Formulir Perkara-1" : {
    "transaction" : "Setup 4 - POST Submit Formulir Perkara-1",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3357.9999999999995,
    "medianResTime" : 3320.0,
    "minResTime" : 2962.0,
    "maxResTime" : 4133.0,
    "pct1ResTime" : 4087.7000000000003,
    "pct2ResTime" : 4133.0,
    "pct3ResTime" : 4133.0,
    "throughput" : 0.5446919766871834,
    "receivedKBytesPerSec" : 17.0484865222779,
    "sentKBytesPerSec" : 0.4914994008388256
  },
  "Setup 4 - POST Submit Formulir Perkara-0" : {
    "transaction" : "Setup 4 - POST Submit Formulir Perkara-0",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2938.5,
    "medianResTime" : 2712.0,
    "minResTime" : 2071.0,
    "maxResTime" : 3916.0,
    "pct1ResTime" : 3907.5,
    "pct2ResTime" : 3916.0,
    "pct3ResTime" : 3916.0,
    "throughput" : 0.5970149253731344,
    "receivedKBytesPerSec" : 1.1275652985074627,
    "sentKBytesPerSec" : 1.6414995335820894
  },
  "Setup 2 - POST Login Klien" : {
    "transaction" : "Setup 2 - POST Login Klien",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6665.400000000001,
    "medianResTime" : 6569.0,
    "minResTime" : 4864.0,
    "maxResTime" : 9016.0,
    "pct1ResTime" : 8967.9,
    "pct2ResTime" : 9016.0,
    "pct3ResTime" : 9016.0,
    "throughput" : 0.5794414184725923,
    "receivedKBytesPerSec" : 32.04514754027118,
    "sentKBytesPerSec" : 1.6477865337814348
  },
  "Step 3 - GET Form Verifikasi Berkas" : {
    "transaction" : "Step 3 - GET Form Verifikasi Berkas",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2780.8,
    "medianResTime" : 2884.0,
    "minResTime" : 1678.0,
    "maxResTime" : 3504.0,
    "pct1ResTime" : 3497.8,
    "pct2ResTime" : 3504.0,
    "pct3ResTime" : 3504.0,
    "throughput" : 0.4996252810392206,
    "receivedKBytesPerSec" : 18.440271358980763,
    "sentKBytesPerSec" : 0.4596162253310017
  },
  "Setup 5 - POST Logout Klien" : {
    "transaction" : "Setup 5 - POST Logout Klien",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3247.0,
    "medianResTime" : 3026.0,
    "minResTime" : 1819.0,
    "maxResTime" : 5097.0,
    "pct1ResTime" : 5094.1,
    "pct2ResTime" : 5097.0,
    "pct3ResTime" : 5097.0,
    "throughput" : 0.5423581733376722,
    "receivedKBytesPerSec" : 15.107641148714611,
    "sentKBytesPerSec" : 1.0264552147738366
  },
  "PF-07 - POST Submit Verifikasi Berkas-0" : {
    "transaction" : "PF-07 - POST Submit Verifikasi Berkas-0",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3477.8999999999996,
    "medianResTime" : 3489.0,
    "minResTime" : 2317.0,
    "maxResTime" : 4340.0,
    "pct1ResTime" : 4310.3,
    "pct2ResTime" : 4340.0,
    "pct3ResTime" : 4340.0,
    "throughput" : 0.5088799552185639,
    "receivedKBytesPerSec" : 0.9735310862042644,
    "sentKBytesPerSec" : 0.6236761169915017
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 220,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3281.354545454545,
    "medianResTime" : 2794.0,
    "minResTime" : 88.0,
    "maxResTime" : 11416.0,
    "pct1ResTime" : 7180.8,
    "pct2ResTime" : 8321.399999999994,
    "pct3ResTime" : 9389.569999999998,
    "throughput" : 4.252275934051067,
    "receivedKBytesPerSec" : 104.09914265902545,
    "sentKBytesPerSec" : 5.904072218624968
  },
  "Setup 1 - GET Login Page (Klien)" : {
    "transaction" : "Setup 1 - GET Login Page (Klien)",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 860.9,
    "medianResTime" : 975.0,
    "minResTime" : 88.0,
    "maxResTime" : 2170.0,
    "pct1ResTime" : 2121.3,
    "pct2ResTime" : 2170.0,
    "pct3ResTime" : 2170.0,
    "throughput" : 1.0055304172951232,
    "receivedKBytesPerSec" : 8.868110545500251,
    "sentKBytesPerSec" : 0.1787173202614379
  },
  "Setup 4 - POST Submit Formulir Perkara" : {
    "transaction" : "Setup 4 - POST Submit Formulir Perkara",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6297.6,
    "medianResTime" : 6399.5,
    "minResTime" : 5034.0,
    "maxResTime" : 7283.0,
    "pct1ResTime" : 7282.7,
    "pct2ResTime" : 7283.0,
    "pct3ResTime" : 7283.0,
    "throughput" : 0.48945230287308505,
    "receivedKBytesPerSec" : 16.24393729198277,
    "sentKBytesPerSec" : 1.7874090689393567
  },
  "Step 2 - POST Login Staf Legal" : {
    "transaction" : "Step 2 - POST Login Staf Legal",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8978.8,
    "medianResTime" : 9211.0,
    "minResTime" : 7192.0,
    "maxResTime" : 11416.0,
    "pct1ResTime" : 11217.2,
    "pct2ResTime" : 11416.0,
    "pct3ResTime" : 11416.0,
    "throughput" : 0.3917113870500215,
    "receivedKBytesPerSec" : 14.6637004729915,
    "sentKBytesPerSec" : 1.1181370940890751
  },
  "Step 2 - POST Login Staf Legal-2" : {
    "transaction" : "Step 2 - POST Login Staf Legal-2",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4503.8,
    "medianResTime" : 4599.5,
    "minResTime" : 3929.0,
    "maxResTime" : 5033.0,
    "pct1ResTime" : 5009.0,
    "pct2ResTime" : 5033.0,
    "pct3ResTime" : 5033.0,
    "throughput" : 0.44089766765133814,
    "receivedKBytesPerSec" : 14.880468508884087,
    "sentKBytesPerSec" : 0.39611899828049907
  },
  "PF-07 - POST Submit Verifikasi Berkas" : {
    "transaction" : "PF-07 - POST Submit Verifikasi Berkas",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6209.8,
    "medianResTime" : 6907.0,
    "minResTime" : 4016.0,
    "maxResTime" : 7503.0,
    "pct1ResTime" : 7490.5,
    "pct2ResTime" : 7503.0,
    "pct3ResTime" : 7503.0,
    "throughput" : 0.468384074941452,
    "receivedKBytesPerSec" : 22.963078161592506,
    "sentKBytesPerSec" : 0.9989754098360655
  },
  "Step 2 - POST Login Staf Legal-1" : {
    "transaction" : "Step 2 - POST Login Staf Legal-1",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2170.9999999999995,
    "medianResTime" : 2130.0,
    "minResTime" : 1178.0,
    "maxResTime" : 3303.0,
    "pct1ResTime" : 3243.9,
    "pct2ResTime" : 3303.0,
    "pct3ResTime" : 3303.0,
    "throughput" : 0.5184570717544588,
    "receivedKBytesPerSec" : 0.9690691751347988,
    "sentKBytesPerSec" : 0.46023191232890914
  },
  "Step 5 - GET Riwayat Verifikasi" : {
    "transaction" : "Step 5 - GET Riwayat Verifikasi",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2542.2999999999997,
    "medianResTime" : 2249.5,
    "minResTime" : 1653.0,
    "maxResTime" : 3908.0,
    "pct1ResTime" : 3881.5,
    "pct2ResTime" : 3908.0,
    "pct3ResTime" : 3908.0,
    "throughput" : 0.6356874960269532,
    "receivedKBytesPerSec" : 29.647993015383637,
    "sentKBytesPerSec" : 0.5767125818447651
  },
  "Step 2 - POST Login Staf Legal-0" : {
    "transaction" : "Step 2 - POST Login Staf Legal-0",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2303.1,
    "medianResTime" : 2096.5,
    "minResTime" : 1670.0,
    "maxResTime" : 3541.0,
    "pct1ResTime" : 3485.7000000000003,
    "pct2ResTime" : 3541.0,
    "pct3ResTime" : 3541.0,
    "throughput" : 0.5664438654129377,
    "receivedKBytesPerSec" : 1.0283390095729013,
    "sentKBytesPerSec" : 0.6051656140251501
  }
}